BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM81.PIC
        <edc:SFRDef edc:_addr="0x55" edc:access="---nnnnn" edc:cname="MCUCR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVCE" edc:desc="Interrupt Vector Change Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IVSEL" edc:desc="Interrupt Vector Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKRC81" edc:desc="Frequency Selection of the Calibrated RC Oscillator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTDIS" edc:desc="Reset Pin Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PUD" edc:desc="Pull-up disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x56" edc:access="nnnnnnnn" edc:cname="SPDR" edc:nzwidth="0x8" ltx:memberofperipheral="SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPD" edc:desc="SPI Data bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x57" edc:access="nnnnnnnn" edc:cname="SPMCSR" edc:nzwidth="0x8" ltx:memberofperipheral="BOOT_LOAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPMEN" edc:desc="Store Program Memory Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PGERS" edc:desc="Page Erase" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PGWRT" edc:desc="Page Write" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BLBSET" edc:desc="Boot Lock Bit Set" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWWSRE" edc:desc="Read While Write section read enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIGRD" edc:desc="Signature Row Read" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWWSB" edc:desc="Read While Write Section Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPMIE" edc:desc="SPM Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x58" edc:access="------nnnnnnnnnn" edc:cname="DAC" edc:nzwidth="0x10" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACH" edc:desc="DAC Data Register Bits" edc:nzwidth="0xA"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TCNT1" edc:desc="Timer/Counter 1 bits" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x5C" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x5D" edc:access="nnnnnnnnnnnnnnnn" edc:cname="SP" edc:nzwidth="0x10" ltx:memberofperipheral="CPU"/>
        <edc:SFRDef edc:_addr="0x5F" edc:access="nnnnnnnn" edc:cname="SREG" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="Zero Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="Negative Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="V" edc:desc="Two's Complement Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Sign Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="H" edc:desc="Half Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T" edc:desc="Bit Copy Storage" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I" edc:desc="Global Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x60" edc:access="----nnnnnnnnnnnn" edc:cname="OCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR0SA" edc:desc="Output Compare 0 SA" edc:nzwidth="0xC"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x62" edc:access="nnnnnnnn" edc:cname="PFRC0A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:desc="PSC 0 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:desc="PSC 0 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:desc="PSC 0 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:desc="PSC 0 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:desc="PSC 0 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x63" edc:access="nnnnnnnn" edc:cname="PFRC0B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:desc="PSC 0 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:desc="PSC 0 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:desc="PSC 0 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:desc="PSC 0 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:desc="PSC 0 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x64" edc:access="----nnnnnnnnnnnn" edc:cname="OCR2SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR2SA" edc:desc="Output Compare 2 SA" edc:nzwidth="0xC"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x66" edc:access="nnnnnnnn" edc:cname="PFRC2A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2A" edc:desc="PSC 2 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2A" edc:desc="PSC 2 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A" edc:desc="PSC 2 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A" edc:desc="PSC 2 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2A" edc:desc="PSC 2 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x67" edc:access="nnnnnnnn" edc:cname="PFRC2B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2B" edc:desc="PSC 2 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2B" edc:desc="PSC 2 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B" edc:desc="PSC 2 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2B" edc:desc="PSC 2 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2B" edc:desc="PSC 2 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x68" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR0" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR0" edc:desc="PSC 0 Input Capture Bytes" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST0" edc:desc="PSC 0 Capture Software Trigger Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
