BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM81.PIC
        <edc:SFRDef edc:_addr="0x6A" edc:access="nnnn-n-n" edc:cname="PSOC0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN0A" edc:desc="PSCOUT00 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN0B" edc:desc="PSCOUT01 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC0" edc:desc="Synchronisation out for ADC selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PISEL0B1" edc:desc="PSC Input Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A1" edc:desc="PSC Input Select" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x6B" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x6C" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR2" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR2" edc:desc="PSC 2 Input Capture Bytes" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST2" edc:desc="PSC 2 Capture Software Trigger Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x6E" edc:access="nnnnnnnn" edc:cname="PSOC2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN2A" edc:desc="PSCOUT20 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2C" edc:desc="PSCOUT22 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:desc="PSCOUT21 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2D" edc:desc="PSCOUT23 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC2" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="POS2" edc:desc="PSC 2 Output 23 Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x6F" edc:access="nnnnnnnn" edc:cname="POM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POMV2A" edc:desc="Output Matrix Output A Ramps" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="POMV2B" edc:desc="Output Matrix Output B Ramps" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x70" edc:access="nnnnnnnn" edc:cname="PCNFE2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PISEL2B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PASDLK2" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x71" edc:access="nnnnnnnn" edc:cname="PASDLY2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PASDLY2" edc:desc="Analog Synchronization Delay bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x72" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x76" edc:access="nnnn-n-n" edc:cname="DACON" edc:nzwidth="0x8" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAEN" edc:desc="DAC Enable Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DALA" edc:desc="DAC Left Adjust" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DATS" edc:desc="DAC Trigger Selection Bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Analog Comparator 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Analog Comparator 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DAATE" edc:desc="DAC Auto Trigger Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x77" edc:access="nnnnnnnn" edc:cname="DIDR0" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC0D" edc:desc="ADC0 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC1D" edc:desc="ADC1 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC2D" edc:desc="ADC2 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC3D" edc:desc="ADC3 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC4D" edc:desc="ADC4 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC5D" edc:desc="ADC5 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC7D" edc:desc="ADC7 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC8D" edc:desc="ADC8 Digital input Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x78" edc:access="----nnnn" edc:cname="DIDR1" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC9D" edc:desc="ADC9 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC10D" edc:desc="ADC10 Digital input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AMP0PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACMP1MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x79" edc:access="nnnnn-nn" edc:cname="AMP0CSR" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AMP0TS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AMP0GS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AMP0G" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="AMP0IS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AMP0EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7A" edc:access="--nnnnnn" edc:cname="AC1ECON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC1H" edc:desc="Analog Comparator Hysteresis Select" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AC1ICE" edc:desc="Analog Comparator Interrupt Capture Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1OE" edc:desc="Analog Comparator Ouput Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1OI" edc:desc="Analog Comparator Ouput Invert" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7B" edc:access="--nn-nnn" edc:cname="AC2ECON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC2H" edc:desc="Analog Comparator Hysteresis Select" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2OE" edc:desc="Analog Comparator Ouput Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2OI" edc:desc="Analog Comparator Ouput Invert" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7C" edc:access="--nn-nnn" edc:cname="AC3ECON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC3H" edc:desc="Analog Comparator Hysteresis Select" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3OE" edc:desc="Analog Comparator Ouput Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3OI" edc:desc="Analog Comparator Ouput Invert" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7D" edc:access="nnnn-nnn" edc:cname="AC1CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC1M" edc:desc="Analog Comparator 1 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1IS" edc:desc="Analog Comparator 1  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC1IE" edc:desc="Analog Comparator 1 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1EN" edc:desc="Analog Comparator 1 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7E" edc:access="nnnn-nnn" edc:cname="AC2CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC2M" edc:desc="Analog Comparator 2 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2IS" edc:desc="Analog Comparator 2  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:desc="Analog Comparator 2 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2EN" edc:desc="Analog Comparator 2 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7F" edc:access="nnnnnnnn" edc:cname="AC3CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC3M" edc:desc="Analog Comparator 3 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AC3OEA" edc:desc="Analog Comparator 3 Alternate Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3IS" edc:desc="Analog Comparator 3  Interrupt Select Bit" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="AC3IE" edc:desc="Analog Comparator 3 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3EN" edc:desc="Analog Comparator3 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x80" edc:access="----nnnn" edc:cname="BGCRR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCR" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x81" edc:access="----nnnn" edc:cname="BGCCR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCC" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x82" edc:access="nnnnnnnn" edc:cname="WDTCSR" edc:nzwidth="0x8" ltx:memberofperipheral="WDT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WDP" edc:desc="Watchdog Timer Prescaler Bits" edc:mask="0x27" edc:nzwidth="0x6">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Oscillator Cycles 2K" edc:when="(field &amp; 0x27) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Oscillator Cycles 4K" edc:when="(field &amp; 0x27) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Oscillator Cycles 8K" edc:when="(field &amp; 0x27) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Oscillator Cycles 16K" edc:when="(field &amp; 0x27) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Oscillator Cycles 32K" edc:when="(field &amp; 0x27) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Oscillator Cycles 64K" edc:when="(field &amp; 0x27) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Oscillator Cycles 128K" edc:when="(field &amp; 0x27) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Oscillator Cycles 256K" edc:when="(field &amp; 0x27) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="Oscillator Cycles 512K" edc:when="(field &amp; 0x27) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="Oscillator Cycles 1024K" edc:when="(field &amp; 0x27) == 0x09"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="WDE" edc:desc="Watch Dog Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDCE" edc:desc="Watchdog Change Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="WDIE" edc:desc="Watchdog Timeout Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDIF" edc:desc="Watchdog Timeout Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
